IDEA StatiCa Open Model
ReinfDiagramType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Reinforcement stress-strain diagram
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum ReinfDiagramType
Public Enumeration ReinfDiagramType
public enum class ReinfDiagramType
Members
Member name | Value | Description
BilinerWithAnInclinedTopBranch | 0 |  Billinear with an inclined top branch
BilinerWithOutAnInclinedTopBranch | 1 |  Billinear without an inclined top branch
DefinedByUser | 2 |  Defined by user
See Also
Reference
IdeaRS.OpenModel.Material Namespace